orchestration/PrepaidCardService_getBalance.template

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ser="http://www.quantiguous.com/services">
   <soap:Header/>
   <soap:Body>
      <ser:getBalance>
         <ser:version>1</ser:version>
         <ser:appID>{{appid}}</ser:appID>
         <ser:mobileNo>9090908765</ser:mobileNo>
      </ser:getBalance>
   </soap:Body>
</soap:Envelope>
